# Задача 11. Даны два ненулевых числа. Найти сумму, разность, произведение и частное их модулей

a = float(input("Введите первое ненулевое число a: "))
b = float(input("Введите второе ненулевое число b: "))

# Находим модули чисел с помощью функции abs()
mod_a = abs(a)
mod_b = abs(b)

# Считаем операции с модулями
summ = mod_a + mod_b
diff = mod_a - mod_b
prod = mod_a * mod_b
quot = mod_a / mod_b

print(f"Сумма модулей равна: {summ}")
print(f"Разность модулей равна: {diff}")
print(f"Произведение модулей равно: {prod}")
print(f"Частное модулей равно: {quot}")
